CCustomInterpolator.GetDependencies(__MIDL___MIDL_itf_UIAnimation_0000_0010_0001*,__MIDL___MIDL_itf_UIAnimation_0000_0010_0001*,__MIDL___MIDL_itf_UIAnimation_0000_0010_0001*)
Gets the interpolator's dependencies.
Returns:
Basic implementation always returns TRUE. Return FALSE from overridden implementation if you wish to fail the event.
initialValueDependencies: Output. Aspects of the interpolator that depend on the initial value passed to SetInitialValueAndVelocity.
initialVelocityDependencies: Output. Aspects of the interpolator that depend on the initial velocity passed to SetInitialValueAndVelocity.
durationDependencies: Output. Aspects of the interpolator that depend on the duration passed to SetDuration.

CCustomInterpolator.InterpolateVelocity(System.Double,System.Double*)
Interpolates the velocity at a given offset
Returns:
Basic implementation always returns TRUE. Return FALSE from overridden implementation if you wish to fail the event.
offset: The offset from the start of the transition.
The offset is always greater than or equal to zero and less than or equal to the duration of the transition.
This method is not called if the duration of the transition is zero.
velocity: Output. The velocity of the variable at the offset.

CCustomInterpolator.InterpolateValue(System.Double,System.Double*)
Interpolates the value at a given offset.
Returns:
Basic implementation always returns TRUE. Return FALSE from overridden implementation if you wish to fail the event.
offset: The offset from the start of the transition.
The offset is always greater than or equal to zero and less than the duration of the transition.
This method is not called if the duration of the transition is zero.
value: Output. The interpolated value.

CCustomInterpolator.GetFinalValue(System.Double*)
Gets the final value to which the interpolator leads.
Returns:
Basic implementation always returns TRUE. Return FALSE from overridden implementation if you wish to fail the event.
value: Output. The final value of a variable at the end of the transition.

CCustomInterpolator.GetDuration(System.Double*)
Gets the interpolator's duration.
Returns:
Basic implementation always returns TRUE. Return FALSE from overridden implementation if you wish to fail the event.
duration: Output. The duration of the transition, in seconds.

CCustomInterpolator.SetDuration(System.Double)
Sets the interpolator's duration.
Returns:
Basic implementation always returns TRUE. Return FALSE from overridden implementation if you wish to fail the event.
duration: The duration of the transition.

CCustomInterpolator.SetInitialValueAndVelocity(System.Double,System.Double)
Sets the interpolator's initial value and velocity.
Returns:
The basic implementation always returns TRUE. Return FALSE from overridden implementation if you wish to fail the event.
initialValue: The value of the variable at the start of the transition.
initialVelocity: The velocity of the variable at the start of the transition.

CCustomInterpolator.Init(System.Double,System.Double)
Initializes duration and final value.
duration: The duration of the transition.
finalValue: The final value of a variable at the end of the transition.

CCustomInterpolator.#ctor(System.Double,System.Double)
Constructs a custom interpolator object and initializes duration and velocity to specified values.
duration: The duration of the transition.

CCustomInterpolator.#ctor
Constructs a custom interpolator object and sets all values to default 0.
Remarks:
Use CCustomInterpolator::Init to initialize duration and final value later in the code.

CCustomInterpolator.m_currentVelocity
The interpolated velocity.

CCustomInterpolator.m_currentValue
The interpolated value.

CCustomInterpolator.m_initialVelocity
The velocity of the variable at the start of the transition.

CCustomInterpolator.m_initialValue
The value of the variable at the start of the transition.

CCustomInterpolator.m_finalValue
The final value of a variable at the end of the transition.

CCustomInterpolator.m_duration
The duration of the transition.

CCustomInterpolator
Implements a basic interpolator.
Remarks:
Derive a class from CCustomInterpolator and override all necessary methods in order to implement a custom
interpolation algorithm. A pointer to this class should be passed as a parameter to CCustomTransition.